# StructuralInstanceUsageFilter Constructor (StructuralInstanceUsage)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralInstanceUsageFilter Constructor (StructuralInstanceUsage)
StructuralInstanceUsageFilter Class See Also
---
Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public StructuralInstanceUsageFilter(
	StructuralInstanceUsage structuralUsage
)
```

Visual Basic
---
```text
Public Sub New ( _
	structuralUsage As StructuralInstanceUsage _
)
```

Visual C++
---
```text
public:
StructuralInstanceUsageFilter(
	StructuralInstanceUsage structuralUsage
)
```

# ### Parameters
structuralUsage
    Type: Autodesk.Revit.DB.Structure..::..StructuralInstanceUsage The family instance structural usage.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
StructuralInstanceUsageFilter Class
StructuralInstanceUsageFilter Overload
Autodesk.Revit.DB.Structure Namespace